app/controllers/sessions_controller.rb

INSERT INTO "users" ("email", "created_at", "updated_at") VALUES (?, ?, ?)  [["email", "smithwebtek@gmail.com"], ["created_at", "2016-11-27 18:06:33.992764"], ["updated_at", "2016-11-27 18:06:33.992764"]]
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "brad@smithwebtek.com"]]
---
  def create
    if request.env["omniauth.auth"]
      @auth = request.env["omniauth.auth"]["info"]
      @user = User.find_or_create_by(email: @auth["email"])